snlkuharlocal/src/Documents/СверкаДанных/СверкаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СверкаДанных</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеИст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеТек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеЦБ</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПБ</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/СверкаДанных/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура УправлениеВидимостью()	
	КодУзлаПБ			= ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод();
	
	ЗаполнитьСписокВыбораТипОбъекта(объект.ТипМетаданных);
	
	// если получены данные, то нельзя менять тип метаданных, тип объекта, тип данных
	ЗапретРедактирования = Объект.ЕстьДанныеИст Или Объект.ЕстьДанныеТек;
	
	МассивПолей = СтрРазделить("ТипМетаданных,ТипОбъекта,ТипДанных,Дата1,Дата2,Подразделение",",");	
	Для Каждого ИмяПоля Из МассивПолей Цикл
		ЭтаФорма.Элементы[ИмяПоля].ТолькоПросмотр = ЗапретРедактирования;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Дата1_ПриИзменении(Элемент)
	Объект.Дата1 = НачалоМесяца(Объект.Дата1);
	Объект.Дата2 = КонецМесяца(Объект.Дата1);
КонецПроцедуры

&НаКлиенте
Процедура Дата2_ПриИзменении(Элемент)	
	Объект.Дата2 = КонецМесяца(Объект.Дата2);
	Объект.Дата1 = НачалоМесяца(Объект.Дата2);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ДокОбъект	= РеквизитФормыВЗначение("Объект");
	АдресДанных	= ДокОбъект.ЗаполнитьДанныеСверки(ЭтаФорма.УникальныйИдентификатор);	
КонецПроцедуры

&НаСервере
Процедура ПоказатьНаСервере()	
	Для Каждого СтрокаТЧ Из Объект.Ссылка.Данные Цикл
		Сообщить(СтрокаТЧ.ДанныеТек.Получить());	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Показать(Команда)
	ПоказатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьтаблицуДанных(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДанных(ДокОбъект)	
	ТаблицаДанных.Очистить();
	Для Каждого СтрокаО Из ДокОбъект.Данные Цикл
		
		СтрокаД	= ТаблицаДанных.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаД,СтрокаО);		
		
		ДанныеЦБ	= СтрокаО.ДанныеЦБ.Получить();
		ДанныеПБ	= СтрокаО.ДанныеПБ.Получить();		
		
		Если ТипЗнч(ДанныеЦБ)=Тип("ТаблицаЗначений") Тогда		
			СтрокаД.ЗаполненоЦБ		= Истина;	
			СтрокаД.СтрокДанныхЦБ	= ДанныеЦБ.Количество();		
		КонецЕсли;
		
		Если ТипЗнч(ДанныеПБ)=Тип("ТаблицаЗначений") Тогда		
			СтрокаД.ЗаполненоПБ		= Истина;	
			СтрокаД.СтрокДанныхПБ	= ДанныеПБ.Количество();		
		КонецЕсли;
		
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбъекта(ДокОбъект)	
	Объект.Данные.Очистить();
	Для Каждого СтрокаО Из ДокОбъект.Данные Цикл
		СтрокаД	= Объект.Данные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаД,СтрокаО);		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПередУдалением(Элемент, Отказ)
	Фильтр=Новый Структура("ТипОбъекта,ТипДанных");
	ЗаполнитьЗначенияСвойств(Фильтр,Элемент.ТекущиеДанные);
	
	Для Каждого Строка Из Объект.Данные.НайтиСтроки(Фильтр) Цикл
		Объект.Данные.Удалить(Строка);	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Шиза полная ......но сессии на сервере нет......хотя временные хранилища есть .....звездец....
	Если ЭтоАдресВременногоХранилища(АдресДанных) Тогда
		ДанныеРегистра		= ПолучитьИзВременногоХранилища(АдресДанных);		
		текИмяПланаОбмена	= ?(ТекущийОбъект.ИмяПланаОбмена="ОбменСЕЕ","ФР_ОбменСФРК",ТекущийОбъект.ИмяПланаОбмена);
	
		Если ТекущийОбъект.КодУзлаСоздания=ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод(текИмяПланаОбмена) Тогда
			ТекущийОбъект.ДанныеТек		= Новый ХранилищеЗначения(ДанныеРегистра);
			ТекущийОбъект.ЕстьДанныеТек	= ЗначениеЗаполнено(ДанныеРегистра);
		Иначе
			ТекущийОбъект.ДанныеИст		= Новый ХранилищеЗначения(ДанныеРегистра);		
			ТекущийОбъект.ЕстьДанныеИст	= ЗначениеЗаполнено(ДанныеРегистра);
		КонецЕсли;
		
		ТекущийОбъект.ДатаФормирования = ТекущаяДата();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТипМетаданных_ПриИзменении(Элемент)
	ЗаполнитьСписокВыбораТипОбъекта(Объект.ТипМетаданных);
КонецПроцедуры

&НаСервере
Функция ПолучитьМетаОбъектыКласса(КлассМетаданных)	
	МО = Новый Массив;
	Если КлассМетаданных="Документы" Тогда
		МетаКол = Метаданные.Документы;
		
		МО.Добавить(МетаКол.ОтчетКассовойСмены);		
		МО.Добавить(МетаКол.ПриходныйКассовыйОрдер);
		МО.Добавить(МетаКол.РасходныйКассовыйОрдер);
		МО.Добавить(МетаКол.УстановкаСкидок);
		МО.Добавить(МетаКол.ПрайсЛист);
		МО.Добавить(МетаКол.ПриходнаяНакладная);
		МО.Добавить(МетаКол.РасходнаяНакладная);
		МО.Добавить(МетаКол.ОприходованиеТМЦ);
		МО.Добавить(МетаКол.СписаниеТМЦ);
		МО.Добавить(МетаКол.Инвентаризация);
	Иначе	
		МетаКол	= Метаданные.РегистрыНакопления;
		
		МО.Добавить(МетаКол.ОстаткиТМЦ);
		МО.Добавить(МетаКол.Продажи);
	КонецЕсли;	
	
	Возврат МО;	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораТипОбъекта(КлассМетаданных) Экспорт	
	МетаОбъекы		= ПолучитьМетаОбъектыКласса(КлассМетаданных);
	СписокВыбора	= Элементы.ТипОбъекта.СписокВыбора;
	Для Каждого МетаОбъект Из МетаОбъекы Цикл
		СписокВыбора.Добавить(МетаОбъект.ПолноеИмя(),""+МетаОбъект);
	КонецЦикла;
	
	СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	// тип данных (остатки или обороты) имеет смысл только для регистров накопления
	ЭтаФорма.Элементы.ТипДанных.Видимость = (КлассМетаданных = "РегистрыНакопления");	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	УправлениеВидимостью();
КонецПроцедуры
